{
    "blondes_jokes.dialog": [],
    "no_joke.dialog": [
        "i could not find any joke about {query}"
    ],
    "general_jokes.dialog": [
        "What is written on the gravestone of a mathematician? \"He didn’t calculate this.\"",
        "One civil servant to another: \"What’s wrong with people? We’re not doing anything.\"",
        "If a yoga instructor stretches his legs straight up and farts, what yoga pose is he doing? A scented candle.",
        "Question: What's the best gift for Trump? Answer: Toilet paper. What else would you give an asshole?",
        "I wanted to call Spider-Man, but he had no network.",
        "Two bombs are sitting in the basement. One says: \"Come on, let's go upstairs.\"",
        "What do you call someone pretending to throw something? A spotlight.",
        "What is written on the gravestone of a cleaning lady? \"She will never return.\"",
        "Wastewater is a topic that definitely needs to be clarified.",
        "Why did the balloon burst? For space reasons.",
        "What is written on the gravestone of a peeper? \"He’s gone from the window.\"",
        "Why are ghosts bad at lying? Because they’re so easy to see through.",
        "Adidas was broken into. What does the police do? They send 3 stripes.",
        "No matter how dense you are, Goethe was a poet.",
        "How was the mood in the GDR? It was limited.",
        "Even in the East, people wear vests.",
        "What does a cannibal get when he's late for dinner? The cold shoulder.",
        "What is written on the gravestone of a wrong-way driver? \"Coming against you. Until the end.\"",
        "What is a cookie under a tree? A shady spot.",
        "Why won’t the coffin open? Because there’s a pimp inside.",
        "Two lightning bolts meet. Hey, high five!",
        "What does a terrorist do in the stairwell? Go up.",
        "The motto of a McDonald's employee? Frying is better than studying.",
        "Patient: \"I’m so nervous. It’s my first surgery.\" Doctor: \"Don’t worry, me too.\"",
        "What were the last words of the gym teacher? \"All spears to me.\"",
        "What do you call the white part of bird poop? Bird poop too!",
        "Daddy, there’s a man at the door. He says he’s collecting for the nursing home. Oh, that’s great. Give him Grandpa.",
        "Dentist to patient: \"You need a crown.\" Patient: \"Finally, someone understands me.\"",
        "One cloud to another: \"Have you seen a skyscraper? I’ve got a terrible itch.\"",
        "The farmer says to his holiday guest: \"In the country, the rooster wakes you up.\" \"Very good, set it for 11 am!\"",
        "The judge asks the defendant: \"Where were you between 3 and 4?\" \"In kindergarten!\" replies the defendant.",
        "A plastic surgeon to another: \"So, what kind of face are you making today?\"",
        "A pig looks at an outlet and says: \"Who walled you in?\"",
        "The teacher asks: \"Why is electricity so important?\" Peter answers: \"If there was no electricity, we’d have to watch TV by candlelight.\"",
        "An old Chinese proverb: \"Every pot fits a dachshund.\"",
        "How do you differentiate German beer from a Dutch penalty kick? The German beer always goes in.",
        "Why do hens lay eggs? Throwing doesn’t work. They’d break.",
        "A farmer is asked how many sheep he has. \"No idea. Every time I start counting, I fall asleep.\"",
        "A man with a frog on his head goes to the doctor. Frog: \"Doctor, I stepped into something.\"",
        "What is written on the gravestone of a peeper? \"I’m gone from the window now.\"",
        "Life lesson: If the blow dryer falls into the bathtub, it was your last glitch.",
        "What’s worse than a worm in an apple? Half a worm in a bitten apple.",
        "Why do Eskimos have the highest life expectancy? They can’t bite the grass.",
        "Money alone doesn’t make anyone happy. You should already possess it.",
        "Saying: Take a lesson from the sofa. It has to deal with every fart.",
        "Lukas complains at home: \"This stupid teacher! Complains about my handwriting, but her ones look like fours!\"",
        "Drinking toast: Never drink more than you can force down.",
        "What does a Pole do on ice? He breaks in.",
        "Poem to finish: All the children escaped from the bear, except Kim, who fell down.",
        "Mommy, will you buy me cookies? Get yourself some! But Mommy, I don’t have arms. No arms, no cookies.",
        "\"My husband died eight days after our wedding!\" \"Well, he didn’t suffer for long!\"",
        "Grandma to grandson: \"You can wish for a nice book from me.\" \"Then I wish for your savings book.\"",
        "She: \"I told you, two beers and be home by 10 pm!\" He: \"Oh, that's what you meant.\"",
        "A man goes to the doctor: \"Doctor, doctor, my problem is no one listens to me!\" Doctor: \"Next, please!\"",
        "The customer: \"I need apples for my husband, are these sprayed with poison?\" \"No, you’ll have to do that yourself.\"",
        "A rooster comes with an ostrich egg to his chicken farm: \"Girls, I don’t want to complain, but look what the competition is doing.\"",
        "Defendant, I really want to know - why do you lie so much? \"It’s because you ask so many questions, Your Honor.\"",
        "A man goes to the gas station: \"How much does a drop of gasoline cost?\" \"Nothing.\" \"Well, then drop me a full tank!\"",
        "Dad, dad, dad!!! Will you let me watch TV? Yes! But don't turn it on!",
        "A math book committed suicide... why? Because it had too many problems."
    ],
    "chuck_norris_jokes.dialog": [
        "When Chuck Norris throws exceptions, it's across the room.",
        "All arrays Chuck Norris declares are of infinite size, because Chuck Norris knows no bounds.",
        "Chuck Norris doesn't have disk latency because the hard drive knows to hurry the hell up, or else.",
        "Chuck Norris writes code that optimises itself.",
        "Chuck Norris can't test for equality because he has no equal.",
        "Chuck Norris doesn't need garbage collection because he doesn't call .Dispose(), he calls .DropKick().",
        "Chuck Norris's first program was kill -9.",
        "Chuck Norris burst the dot com bubble.",
        "All browsers support the hex definitions #chuck and #norris for the colours black and blue.",
        "MySpace isn't really your space, it's Chuck's (he just lets you use it).",
        "Chuck Norris can write infinitely recursive functions and have them return.",
        "Chuck Norris can solve the Towers of Hanoi in one move.",
        "The only design pattern Chuck Norris knows is the God Object Pattern.",
        "Chuck Norris finished World of Warcraft.",
        "Project managers never ask Chuck Norris for estimations.",
        "Chuck Norris doesn't use web standards as the web will conform to him.",
        "'It works on my machine' always holds true for Chuck Norris.",
        "Chuck Norris doesn't do Burn Down charts, he does Smack Down charts.",
        "Chuck Norris can delete the Recycling Bin.",
        "Chuck Norris's beard can type 140 words per minute.",
        "Chuck Norris can unit test entire applications with a single assertion, 'it works'.",
        "Chuck Norris doesn't bug hunt as that signifies a probability of failure, he goes bug killing.",
        "Chuck Norris's keyboard doesn't have a Ctrl key because nothing controls Chuck Norris.",
        "Chuck Norris can overflow your stack just by looking at it.",
        "To Chuck Norris, everything contains a vulnerability.",
        "Chuck Norris doesn't sudo, the shell just knows it's him and does what it's told.",
        "Chuck Norris doesn't need a debugger, he just stares at the code until it confesses.",
        "Chuck Norris can access private methods.",
        "Chuck Norris can instantiate an abstract class.",
        "Chuck Norris does not need to know about Class Factory Pattern. He can instantiate interfaces.",
        "The class object inherits from Chuck Norris.",
        "For Chuck Norris, NP-Hard = O(1).",
        "Chuck Norris knows the last digit of Pi.",
        "Chuck Norris's Internet connection is faster upstream than downstream because even data has more incentive to run from him than to him.",
        "Chuck Norris solved the Travelling Salesman problem in O(1) time: break salesman into N pieces; kick each piece to a different city.",
        "No statement can catch the ChuckNorrisException.",
        "Chuck Norris doesn't pair program.",
        "Chuck Norris can write multi-threaded applications with a single thread.",
        "Chuck Norris doesn't need to use AJAX because pages are too afraid to postback anyways.",
        "Chuck Norris doesn't use reflection, reflection asks politely for his help.",
        "There is no Esc key on Chuck Norris' keyboard, because no one escapes Chuck Norris.",
        "Chuck Norris can binary search unsorted data.",
        "Chuck Norris doesn't needs try-catch, exceptions are too afraid to raise.",
        "Chuck Norris went out of an infinite loop.",
        "If Chuck Norris writes code with bugs, the bugs fix themselves.",
        "Chuck Norris hosting is 101% uptime guaranteed.",
        "Chuck Norris's keyboard has the Any key.",
        "Chuck Norris can access the database from the UI.",
        "Chuck Norris's programs never exit, they are terminated.",
        "Chuck Norris insists on strongly-typed programming languages.",
        "The Chuck Norris protocol design method has no status, requests or responses, only commands.",
        "Chuck Norris's programs occupy 150% of CPU, even when they are not running.",
        "Chuck Norris can spawn threads that complete before they are started.",
        "Chuck Norris's programs do not accept input.",
        "Chuck Norris can install iTunes without installing Quicktime.",
        "Chuck Norris doesn't need an OS.",
        "Chuck Norris's OSI network model has only one layer - Physical.",
        "Chuck Norris can compile syntax errors.",
        "Every SQL statement that Chuck Norris codes has an implicit 'COMMIT' in its end.",
        "Chuck Norris does not need to type-cast. The Chuck-Norris Compiler (CNC) sees through things. All the way down. Always.",
        "Chuck Norris does not code in cycles, he codes in strikes.",
        "Chuck Norris compresses his files by doing a flying round house kick to the hard drive.",
        "Chick Norris solved the halting problem.",
        "With Chuck Norris P = NP. There's no nondeterminism with Chuck Norris decisions.",
        "Chuck Norris can retrieve anything from /dev/null.",
        "No one has ever pair-programmed with Chuck Norris and lived to tell the tale.",
        "No one has ever spoken during review of Chuck Norris' code and lived to tell the tale.",
        "Chuck Norris doesn't use a GUI, he prefers COMMAND line.",
        "Chuck Norris doesn't use Oracle, he is the Oracle.",
        "Chuck Norris can dereference NULL.",
        "A diff between your code and Chuck Norris's is infinite.",
        "The Chuck Norris Eclipse plugin made alien contact.",
        "Chuck Norris is the ultimate mutex, all threads fear him.",
        "Don't worry about tests, Chuck Norris's test cases cover your code too.",
        "Each hair in Chuck Norris's beard contributes to make the world's largest DDOS.",
        "Chuck Norris's log statements are always at the FATAL level.",
        "Chuck Norris's database has only one table, 'Kick', which he drops frequently.",
        "Chuck Norris completed World of Warcraft.",
        "When Chuck Norris breaks the build, you can't fix it, because there is not a single line of code left.",
        "Chuck Norris types with one finger. He points it at the keyboard and the keyboard does the rest.",
        "Chuck Norris's programs can pass the Turing Test by staring at the interrogator.",
        "If you try to kill -9 Chuck Norris's programs, it backfires.",
        "Chuck Norris performs infinite loops in under 4 seconds.",
        "Chuck Norris can overwrite a locked variable.",
        "Chuck Norris knows the value of NULL, and he can sort by it too.",
        "Chuck Norris can install a 64-bit operating system on 32-bit machines.",
        "Chuck Norris can write to an output stream.",
        "Chuck Norris can read from an input stream.",
        "Chuck Norris never has to build his program to machine code. Machines have learnt to interpret Chuck Norris's code.",
        "Chuck Norris's unit tests don't run. They die.",
        "Chuck Norris causes the Blue Screen of Death.",
        "Chuck Norris can make a class that is both abstract and final.",
        "Chuck Norris could use anything in java.util.* to kill you, including the javadocs.",
        "Code runs faster when Chuck Norris watches it.",
        "Chuck Norris doesn't use REST, he waits.",
        "Everyone likes Chuck Norris on Facebook, whether they choose to or not.",
        "You can't follow Chuck Norris on Twitter, because he follows you.",
        "Chuck Norris's calculator has only 3 keys: 0, 1, and NAND.",
        "Chuck Norris only uses global variables. He has nothing to hide.",
        "Chuck Norris once implemented an HTTP server in a single printf call. It is now the heart of Apache webserver.",
        "Chuck Norris writes directly in binary. He then writes the source code as documentation for other programmers.",
        "Chuck Norris once shifted a bit so hard, it ended up on a different computer.",
        "Q: What is Chuck Norris's favorite Javascript framework? A: Knockout.js."
    ],
    "dad_jokes.dialog": [
        "Egyptians claimed to invent the guitar, but they were such lyres.﻿",
        "So, I heard this pun about cows, but it’s kinda offensive so I won’t say it. I don’t want there to be any beef between us. ",
        "If at first you don't succeed, sky diving is not for you!",
        "Mahatma Gandhi, as you know, walked barefoot most of the time, which produced an impressive set of calluses on his feet.   He also ate very little, which made him rather frail and with his odd diet, he suffered from bad breath.   This made him a super calloused fragile mystic hexed by halitosis.",
        "Mountains aren't just funny, they are hill areas",
        "What kind of pants do ghosts wear? Boo jeans.",
        "What do you get when you run over a bird with your lawnmower? Shredded tweet.",
        "What has ears but cannot hear? A field of corn.",
        "How do you make a water bed more bouncy. You use Spring Water",
        "What's the difference between a hippo and a zippo? One is really heavy, the other is a little lighter.",
        "What is the difference between ignorance and apathy?    I don't know and I don't care.",
        "Why did the A go to the bathroom and come out as an E? Because he had a vowel movement.",
        "What do you do when you see a space man?  Park your car, man.",
        "Conjunctivitis.com – now that’s a site for sore eyes.",
        "My son is studying to be a surgeon, I just hope he makes the cut.",
        "Why are fish so smart? Because they live in schools!",
        "Did you hear about the scientist who was lab partners with a pot of boiling water? He had a very esteemed colleague.",
        "Why did the tomato blush? Because it saw the salad dressing.",
        "What did one plate say to the other plate? Dinner is on me!",
        "How do you organize a space party? You planet.",
        "\"Dad, I'm cold.\"  \"Go stand in the corner, I hear it's 90 degrees.\"",
        "Why do you never see elephants hiding in trees? Because they're so good at it.",
        "Have you heard about the film \"Constipation\", you probably haven't because it's not out yet.",
        "There's not really any training for garbagemen. They just pick things up as they go.",
        "Why do wizards clean their teeth three times a day? To prevent bat breath!",
        "If you're struggling to think of what to get someone for Christmas. Get them a fridge, and watch their face light up when they open it.",
        "What creature is smarter than a talking parrot? A spelling bee.",
        "Why do birds fly south for the winter? Because it's too far to walk.",
        "Why did the fireman wear red, white, and blue suspenders? To hold his pants up.",
        "What's a pirate's favorite letter? It be the Sea",
        "A woman is on trial for beating her husband to death with his guitar collection. Judge says, ‘First offender?’ She says, ‘No, first a Gibson! Then a Fender!’",
        "How does a penguin build it’s house? Igloos it together.",
        "How does a dyslexic poet write? Inverse.",
        "I made a playlist for hiking. It has music from Peanuts, The Cranberries, and Eminem. I call it my Trail Mix.",
        "I knew a guy who collected candy canes, they were all in mint condition",
        "What did the Dorito farmer say to the other Dorito farmer? Cool Ranch!",
        "I finally bought the limited edition Thesaurus that I've always wanted. When I opened it, all the pages were blank.  I have no words to describe how angry I am.",
        "Don't trust atoms. They make up everything.",
        "What animal is always at a game of cricket? A bat.",
        "The invention of the wheel was what got things rolling",
        "What's worse than finding a worm in your apple? Finding half a worm.",
        "A book just fell on my head. I only have my shelf to blame.",
        "Velcro… What a rip-off.",
        "I got a reversible jacket for Christmas, I can't wait to see how it turns out.",
        "Some people eat light bulbs. They say it's a nice light snack.",
        "Camping is intense.",
        "Man, I really love my furniture... me and my recliner go way back.",
        "Why can't you use \"Beef stew\" as a password? Because it's not stroganoff.",
        "Did you hear about the submarine industry? It really took a dive...",
        "I went to the store to pick up eight cans of sprite... when I got home I realized I'd only picked seven up",
        "Why do bees hum? Because they don't know the words.",
        "A ham sandwich walks into a bar and orders a beer. The bartender looks at him and says, \"Sorry we don't serve food here.\"",
        "My sister bet me $15 that I couldn't build a car out of spaghetti. You should have seen the look on her face as I drove pasta.",
        "A weasel walks into a bar. The bartender says, \"Wow, I've never served a weasel before. What can I get for you?\"  \"Pop,\" goes the weasel.",
        "What do you call a nervous javelin thrower? Shakespeare.",
        "Did you know you should always take an extra pair of pants golfing? Just in case you get a hole in one.",
        "I used to be addicted to soap, but I'm clean now.",
        "A man tried to sell me a coffin today. I told him that's the last thing I need.",
        "What do you call a duck that gets all A's? A wise quacker.",
        "Did you know crocodiles could grow up to 15 feet? But most just have 4.",
        "Where did Napoleon keep his armies? Up his sleevies.",
        "I'm practicing for a bug-eating contest and I've got butterflies in my stomach.",
        "I was fired from the keyboard factory yesterday.  I wasn't putting in enough shifts.",
        "I was just looking at my ceiling. Not sure if it’s the best ceiling in the world, but it’s definitely up there.",
        "Leather is great for sneaking around because it's made of hide.",
        "I’m only familiar with 25 letters in the English language. I don’t know why.",
        "Did you hear about the kidnapping at school? It's ok, he woke up.",
        "So a duck walks into a pharmacy and says “Give me some chap-stick… and put it on my bill”",
        "Why does it take longer to get from 1st to 2nd base, than it does to get from 2nd to 3rd base? Because there’s a Shortstop in between!",
        "Why was the broom late for the meeting? He overswept.",
        "Why do crabs never give to charity? Because they're shellfish.",
        "I ate a clock yesterday. It was so time consuming.",
        "They tried to make a diamond shaped like a duck. It quacked under the pressure.",
        "Hear about the new restaurant called Karma? There’s no menu: You get what you deserve.",
        "How many South Americans does it take to change a lightbulb? A Brazilian",
        "What did Romans use to cut pizza before the rolling cutter was invented? Lil Caesars",
        "I am terrified of elevators. I'm going to start taking steps to avoid them.",
        "Why was Pavlov's beard so soft?  Because he conditioned it.",
        "What has three letters and starts with gas? A Car.",
        "The rotation of earth really makes my day.",
        "When my wife told me to stop impersonating a flamingo, I had to put my foot down.",
        "I asked the checkout girl for a date. She said \"They're in the fruit aisle next to the bananas.\"",
        "What did one wall say to the other wall? I'll meet you at the corner!",
        "Coffee has a tough time at my house, every morning it gets mugged.",
        "I fear for the calendar, its days are numbered. ",
        "Why does a chicken coop only have two doors? Because if it had four doors it would be a chicken sedan.",
        "My boss told me to have a good day. So I went home...",
        "Where did Captain Hook get his hook? From a second hand store.",
        "What did the left eye say to the right eye? Between us, something smells!",
        "What did the mountain climber name his son? Cliff.",
        "What type of music do balloons hate? Pop music!",
        "Slept like a log last night … woke up in the fireplace.",
        "Did you hear about the two thieves who stole a calendar? They each got six months.",
        "How do you know if there’s an elephant under your bed? Your head hits the ceiling!",
        "What do you call a pig that knows karate? A pork chop!",
        "Why do fish live in salt water? Because pepper makes them sneeze!",
        "Why do bears have hairy coats? Fur protection.",
        "I couldn't get a reservation at the library. They were completely booked.",
        "How many seconds are in a year?  12.  January 2nd, February 2nd, March 2nd, April 2nd.... etc",
        "I think circles are pointless.",
        "A butcher accidentally backed into his meat grinder and got a little behind in his work that day.",
        "You can't trust a ladder. It will always let you down",
        "Did you hear that the police have a warrant out on a midget psychic ripping people off? It reads \"Small medium at large.\"",
        "My wife is on a tropical fruit diet, the house is full of stuff. It is enough to make a mango crazy.",
        "What do you call an alligator in a vest? An in-vest-igator!",
        "I don't trust stairs. They're always up to something.",
        "“My Dog has no nose.” “How does he smell?” “Awful”",
        "Doctor you've got you help me, I'm addicted to twitter. Doctor: I don't follow you.",
        "I burned 2000 calories today, I left my food in the oven for too long.",
        "Singing in the shower is all fun and games until you get shampoo in your mouth. Then it's a soap opera.",
        "Where do bees go to the bathroom?  The BP station.",
        "My wife told me to rub the herbs on the meat for better flavor. That's sage advice.",
        "What is a tornado's favorite game to play? Twister!",
        "Dad I’m hungry’ … ‘Hi hungry I’m dad",
        "How was the snow globe feeling after the storm? A little shaken.",
        "Why do valley girls hang out in odd numbered groups? Because they can't even.",
        "Did you hear the joke about the wandering nun? She was a roman catholic.",
        "Why do crabs never give to charity? Because they’re shellfish.",
        "Is there a hole in your shoe? No… Then how’d you get your foot in it?",
        "Why is it so windy inside an arena? All those fans.",
        "What’s the difference between an African elephant and an Indian elephant? About 5000 miles.",
        "What's the difference between a seal and a sea lion?  An ion! ",
        "Why do mathematicians hate the U.S.? Because it's indivisible.",
        "You can't run through a camp site. You can only ran, because it's past tents.",
        "I’ll tell you something about German sausages, they’re the wurst",
        "How do you turn a duck into a soul singer? Put it in a microwave until its bill withers.",
        "How do you steal a coat? You jacket.",
        "Every machine in the coin factory broke down all of a sudden without explanation. It just doesn’t make any cents.",
        "A farmer had 297 cows, when he rounded them up, he found he had 300",
        "Why did the girl smear peanut butter on the road? To go with the traffic jam.",
        "This is my step ladder. I never knew my real ladder.",
        "I got an A on my origami assignment when I turned my paper into my teacher",
        "How does Darth Vader like his toast? On the dark side.",
        "Did you hear about the cheese factory that exploded in France? There was nothing left but de Brie.",
        "A red and a blue ship have just collided in the Caribbean. Apparently the survivors are marooned.",
        "Why did the worker get fired from the orange juice factory? Lack of concentration.",
        "Writing with a broken pencil is pointless.",
        "When do doctors get angry? When they run out of patients.",
        "When does a joke become a dad joke? When it becomes apparent.",
        "Today a girl said she recognized me from vegetarian club, but I'm sure I've never met herbivore.",
        "A proton, an electron, & a neutron walk into a bar. The proton orders a shot, drinks it, pulls out his wallet, and pays the bartender. The electron orders a shot, drinks it, pulls out his wallet, and pays the bartender. The neutron orders a shot, drinks it, then pulls out his wallet. The bartender stops him and says, \"for you, no charge...\"",
        "There’s a new type of broom out, it’s sweeping the nation.",
        "Never Trust Someone With Graph Paper...    They're always plotting something.",
        "Can I watch the TV? Dad: Yes, but don’t turn it on.",
        "Where’s the bin? Dad: I haven’t been anywhere!",
        "Wife told me to take the spider out instead of killing it... We had some drinks, cool guy, wants to be a web developer.",
        "How do you tell the difference between a crocodile and an alligator? You will see one later and one in a while.",
        "Do I enjoy making courthouse puns? Guilty",
        "How do you fix a broken pizza? With tomato paste.",
        "Why do chicken coops only have two doors? Because if they had four, they would be chicken sedans.",
        "My friend told me that pepper is the best seasoning for a roast, but I took it with a grain of salt.",
        "Never take advice from electrons. They are always negative.",
        "I considered building the patio by myself. But I didn't have the stones.",
        "How did the hipster burn the roof of his mouth? He ate the pizza before it was cool.",
        "I asked the surgeon if I could administer my own anesthetic, they said: go ahead, knock yourself out.",
        "Someone broke into my house last night and stole my limbo trophy. How low can you go?",
        "What do bees do after they are married? They go on a honeymoon.",
        "What do you call a bear with no teeth? A gummy bear!",
        "What did the big flower say to the littler flower? Hi, bud!",
        "Why did the teddy bear say “no” to dessert? Because she was stuffed.",
        "Did you hear about the new restaurant on the moon? The food is great, but there’s just no atmosphere.",
        "Wife: Honey I’m pregnant.    Me: Well…. what do we do now?    Wife: Well, I guess we should go to a baby doctor.    Me: Hm.. I think I’d be a lot more comfortable going to an adult doctor.",
        "Where do you take someone who has been injured in a Peek-a-boo accident? To the I.C.U.",
        "It takes guts to be an organ donor.",
        "My boss told me to have a good day... so I went home.",
        "Did you hear about the Mexican train killer? He had loco motives",
        "Who is the coolest Doctor in the hospital? The hip Doctor!",
        "I was at the library and asked if they have any books on \"paranoia\", the librarian replied, \"yes, they are right behind you\"",
        "What's big, red, and eats rocks? A big, red, rock-eater.",
        "I’ve just been reading a book about anti-gravity, it’s impossible to put down!",
        "What do you call corn that joins the army? Kernel.",
        "Two dyslexics walk into a bra.",
        "Why was it called the dark ages? Because of all the knights. ",
        "What was a more important invention than the first telephone? The second one.",
        "What's the difference between a guitar and a fish? You can tune a guitar but you can't \"tuna\" fish!",
        "To be Frank, I'd have to change my name.",
        "What do you call an old snowman? Water.",
        "Astronomers got tired watching the moon go around the earth for 24 hours. They decided to call it a day.",
        "What do you call a monkey in a mine field? A babooooom! ",
        "Why do bees have sticky hair? Because they use honey combs!",
        "What do you call a group of disorganized cats? A cat-tastrophe.",
        "I made a belt out of watches once... It was a waist of time.",
        "What do you get if you cross the Atlantic with the Titanic? About halfway.",
        "Did you hear about the cow who jumped over the barbed wire fence? It was udder destruction.",
        "Ever wondered why bees hum? It's because they don't know the words.",
        "What biscuit does a short person like? Shortbread. ",
        "What is the best way to carve?  Whittle by whittle.",
        "I just swapped our bed for a trampoline. My wife hit the roof.",
        "How many kids with ADD does it take to change a lightbulb? Let's go ride bikes!",
        "Every night at 11:11, I make a wish that someone will come fix my broken clock.",
        "Why do choirs keep buckets handy? So they can carry their tune",
        "Want to hear a joke about construction? Nah, I'm still working on it.",
        "What musical instrument is found in the bathroom? A tuba toothpaste.",
        "What did the Zen Buddist say to the hotdog vendor? Make me one with everything.",
        "What do you call a dad that has fallen through the ice? A Popsicle.",
        "A quick shoutout to all of the sidewalks out there... Thanks for keeping me off the streets.",
        "I've just written a song about a tortilla. Well, it is more of a rap really.",
        "Why did the cookie cry? It was feeling crumby.",
        "Why did the golfer bring two pairs of pants? In case he got a hole-in-one.",
        "A man walked in to a bar with some asphalt on his arm. He said “Two beers please, one for me and one for the road.”",
        "When is a door not a door? When it's ajar.",
        "Why didn't the number 4 get into the nightclub? Because he is 2 square.",
        "What is the hardest part about sky diving? The ground.",
        "Today a man knocked on my door and asked for a small donation towards the local swimming pool. I gave him a glass of water.",
        "A man is washing the car with his son. The son asks...... \"Dad, can’t you just use a sponge?\"",
        "Why did the house go to the doctor? It was having window panes.",
        "What do you get hanging from Apple trees? Sore arms.",
        "Doctor you've got to help me, I'm addicted to Twitter. Doctor: I don't follow you.",
        "How do you fix a damaged jack-o-lantern? You use a pumpkin patch.",
        "What is the least spoken language in the world?  Sign Language",
        "What did the 0 say to the 8? Nice belt.",
        "What is a witch's favorite subject in school? Spelling!",
        "Where did you learn to make ice cream? Sunday school.",
        "What does an angry pepper do? It gets jalapeño face.",
        "How many apples grow on a tree? All of them!",
        "What kind of magic do cows believe in? MOODOO.",
        "Where does batman go to the bathroom? The batroom.",
        "Why did the banana go to the doctors'? He wasn't peeling very well.",
        "What was the pumpkin’s favorite sport?    Squash.",
        "Have you heard about corduroy pillows?  They're making headlines!",
        "Why do pumpkins sit on people’s porches?    They have no hands to knock on the door.",
        "My dog used to chase people on a bike a lot. It got so bad I had to take his bike away.",
        "This morning I was wondering where the sun was, but then it dawned on me.",
        "What do prisoners use to call each other? Cell phones.",
        "What's the difference between a poorly dressed man on a tricycle and a well dressed man on a bicycle? Attire.",
        "What did the hat say to the scarf?  You can hang around. I'll just go on ahead.  ",
        "What is red and smells like blue paint?  Red paint!",
        "How do hens stay fit? They always egg-cercise!",
        "What kind of music do planets listen to? Nep-tunes.",
        "I was so proud when I finished the puzzle in six months, when on the side it said three to four years.",
        "I'll tell you what often gets over looked... garden fences.",
        "Can February march? No, but April may.",
        "I applied to be a doorman but didn't get the job due to lack of experience. That surprised me, I thought it was an entry level position.",
        "What is a vampire's favorite fruit? A blood orange.",
        "Archaeology really is a career in ruins.",
        "What's large, grey, and doesn't matter?  An irrelephant.  ",
        "Did you hear that David lost his ID in prague? Now we just have to call him Dav.",
        "How come the stadium got hot after the game? Because all of the fans left.",
        "What do you get hanging off banana trees? Sore arms.",
        "Two fish are in a tank, one turns to the other and says, \"how do you drive this thing?\"",
        "Recent survey revealed 6 out of 7 dwarf's aren't happy.",
        "What do vegetarian zombies eat? Grrrrrainnnnnssss.",
        "Atheism is a non-prophet organisation.",
        "A steak pun is a rare medium well done.",
        "Why are graveyards so noisy? Because of all the coffin.",
        "Cosmetic surgery used to be such a taboo subject.  Now you can talk about Botox and nobody raises an eyebrow.",
        "What do you get when you cross a bee and a sheep? A bah-humbug.  ",
        "My boss told me to attach two pieces of wood together... I totally nailed it!",
        "How does a burglar get into your house? Intruder window.",
        "Why did the cookie cry?  Because his mother was a wafer so long",
        "Some people say that comedians who tell one too many light bulb jokes soon burn out, but they don't know watt they are talking about. They're not that bright.",
        "What did the scarf say to the hat? You go on ahead, I am going to hang around a bit longer.",
        "Why are skeletons so calm? Because nothing gets under their skin.",
        "I cut my finger chopping cheese, but I think that I may have grater problems.",
        "How do you get two whales in a car? Start in England and drive West.",
        "What's the worst thing about ancient history class? The teachers tend to Babylon.",
        "Somebody stole my Microsoft Office and they're going to pay - you have my Word.",
        "What is a centipedes's favorite Beatle song?  I want to hold your hand, hand, hand, hand...",
        "What does a pirate pay for his corn? A buccaneer!",
        "Where do you learn to make banana splits? At sundae school.",
        "I knew i shouldn’t have ate that seafood. Because now i’m feeling a little… Eel",
        "What did the pirate say on his 80th birthday? Aye Matey!",
        "\"Hey, dad, did you get a haircut?\" \"No, I got them all cut.\"",
        "A bartender broke up with her boyfriend, but he kept asking her for another shot.",
        "“Hold on, I have something in my shoe”  “I’m pretty sure it’s a foot”",
        "A Sandwich walks into a bar, the bartender says “Sorry, we don’t serve food here”",
        "A man walks into a bar and orders helicopter flavor chips. The barman replies “sorry mate we only do plain”",
        "Just read a few facts about frogs. They were ribbiting.",
        "I just read a book about Stockholm syndrome. It was pretty bad at first, but by the end I liked it.",
        "Why do ducks make great detectives? They always quack the case.",
        "Q: What did the spaghetti say to the other spaghetti?  A: Pasta la vista, baby!",
        "What’s brown and sounds like a bell? Dung!",
        "\"What time is it?\" I don't know... it keeps changing.",
        "Where do cats write notes?  Scratch Paper!",
        "Why didn’t the orange win the race? It ran out of juice.",
        "*Reversing the car* \"Ah, this takes me back\"",
        "What do you do on a remote island? Try and find the TV island it belongs to.",
        "Did you hear about the chameleon who couldn't change color? They had a reptile dysfunction.",
        "Did you hear the one about the giant pickle?  He was kind of a big dill.",
        "Two peanuts were walking down the street. One was a salted",
        "It's only a murder of crows if there's probable caws.",
        "Astronomers got tired of watching the moon go round the earth for 24 hours, so they decided to call it a day.",
        "Why don't you find hippopotamuses hiding in trees?  They're really good at it.",
        "What do birds give out on Halloween? Tweets.",
        "My cat just threw up on the carpet. I don't think it's feline well.",
        "I tried taking some high resolution photos of local farmland, but they all turned out a bit grainy.",
        "What did the green grape say to the purple grape?  BREATH!!",
        "I wear a stethoscope so that in a medical emergency I can teach people a valuable lesson about assumptions.",
        "Why are basketball players messy eaters? Because they are always dribbling.",
        "My new thesaurus is terrible. In fact, it's so bad, I'd say it's terrible.",
        "Some people say that I never got over my obsession with Phil Collins.  But take a look at me now.",
        "What did the Red light say to the Green light? Don't look at me I'm changing!",
        "What do you call a fly without wings? A walk.",
        "What did the digital clock say to the grandfather clock? Look, no hands!",
        "Whiteboards are remarkable.",
        "The other day I was listening to a song about superglue, it’s been stuck in my head ever since.",
        "I used to work at a stationery store.  But, I didn't feel like I was going anywhere.    So, I got a job at a travel agency.  Now, I know I'll be going places.",
        "I used to work for a soft drink can crusher. It was soda pressing.",
        "What do you get when you cross a chicken with a skunk? A fowl smell!",
        "I am so good at sleeping I can do it with my eyes closed!",
        "Two silk worms had a race. They ended up in a tie.",
        "Want to hear a chimney joke? Got stacks of em! First one's on the house",
        "If two vegans are having an argument, is it still considered beef?",
        "What does a female snake use for support? A co-Bra!",
        "‘Put the cat out’ … ‘I didn’t realize it was on fire",
        "It doesn't matter how much you push the envelope. It will still be stationary.",
        "What do you call a fish with no eyes? A fsh.",
        "I went to the zoo the other day, there was only one dog in it. It was a shitzu.",
        "Where does Napoleon keep his armies? In his sleevies.",
        "Don't buy flowers at a monastery. Because only you can prevent florist friars.",
        "I just broke my guitar. It's okay, I won't fret",
        "Why did the octopus beat the shark in a fight? Because it was well armed.",
        "What lies on the ocean floor and shivers? A nervous wreck.",
        "I was thinking about moving to Moscow but there is no point Russian into things.",
        "Remember, the best angle to approach a problem from is the \"try\" angle.",
        "Why did the m&m go to school? Because it wanted to be a Smartie!",
        "When will the little snake arrive? I don't know but he won't be long...",
        "Don't tell secrets in corn fields. Too many ears around.",
        "Why didn’t the skeleton cross the road? Because he had no guts.",
        "I had a rough day, and then somebody went and ripped the front and back pages from my dictionary. It just goes from bad to worse.",
        "What did the ocean say to the shore? Nothing, it just waved.",
        "How do you make holy water? You boil the hell out of it.",
        "I knew I shouldn't steal a mixer from work, but it was a whisk I was willing to take.",
        "Two atoms are walking down the street. One says, \"Oh no! I lost an electron!\", The other asks him, \"Are you sure?\", The first one says, \"Yeah, I'm positive\"",
        "Why do so many people with laser hair want to get it removed?",
        "What do you call a sheep with no legs? A cloud.",
        "A ghost walks into a bar and asks for a glass of vodka but the bar tender says, “sorry we don’t serve spirits”",
        "What kind of award did the dentist receive? A little plaque.",
        "I saw a documentary on TV last night about how they put ships together.  It was rivetting.",
        "I had a dream that I was a muffler last night. I woke up exhausted!",
        "What's the difference between a hippo and a Zippo? One is heavy, and the other is a little lighter.",
        "\"I'll call you later.\" Don't call me later, call me Dad.",
        "Why do scuba divers fall backwards into the water? Because if they fell forwards they’d still be in the boat.",
        "How does a scientist freshen their breath? With experi-mints!",
        "What do you call a group of killer whales playing instruments? An Orca-stra.",
        "How many hipsters does it take to change a lightbulb? Oh, it's a really obscure number. You've probably never heard of it.",
        "Why shouldn't you play cards in the jungle? Too many cheetahs.",
        "What is the richest country in the world? Ireland. Its capital is always Dublin.",
        "I am terrified of elevators. I’m going to start taking steps to avoid them.",
        "Doctor: Do you want to hear the good news or the bad news?  Patient: Good news please.  Doctor: we're naming a disease after you.",
        "It's difficult to say what my wife does, she sells sea shells by the sea shore.",
        "Yesterday a clown held a door open for me. I thought it was a nice jester.",
        "Did you hear about the runner who was criticized? He just took it in stride",
        "Why are giraffes so slow to apologize? Because it takes them a long time to swallow their pride.",
        "An apple a day keeps the bullies away. If you throw it hard enough.",
        "What did one snowman say to the other snow man? Do you smell carrot?",
        "How do robots eat guacamole? With computer chips.",
        " I never wanted to believe that my Dad was stealing from his job as a road worker. But when I got home, all the signs were there.    ",
        "You know what they say about cliffhangers...",
        "What's blue and not very heavy?  Light blue.",
        "Milk is also the fastest liquid on earth. It's pasteurized before you even see it.",
        "Where was the Declaration of Independence signed?    At the bottom! ",
        "Why did the miner get fired from his job? He took it for granite...",
        "Why does Waldo only wear stripes? Because he doesn't want to be spotted.",
        "What is the tallest building in the world? The library – it’s got the most stories!",
        "\"Dad, I'm hungry.\" Hello, Hungry. I'm Dad.",
        "What do you get when you cross a rabbit with a water hose? Hare spray.",
        "I used to have a job at a calendar factory but I got the sack because I took a couple of days off.",
        "A Mexican magician says he'll disappear on the count of 3; \"Uno... dos... poof...\". He disappeared without a tres.",
        "Did you hear about the guy who invented Lifesavers? They say he made a mint.",
        "When you have a bladder infection, urine trouble.",
        "Why did the kid throw the clock out the window? He wanted to see time fly!",
        "Why did the kid cross the playground? To get to the other slide.",
        "What kind of bagel can fly? A plain bagel.",
        "Why do pirates not know the alphabet? They always get stuck at \"C\".",
        "Did you hear that the police have a warrant out on a midget psychic ripping people off? It reads “Small medium at large.”",
        "I used to be addicted to the hokey pokey, but I turned myself around.",
        "The Swiss must've been pretty confident in their chances of victory if they included a corkscrew in their army knife.",
        "Is the pool safe for diving? It deep ends.",
        "Where do young cows eat lunch? In the calf-ateria.",
        "How do the trees get on the internet? They log on.",
        "Why did the barber win the race? He took a short cut.",
        "Why can't you hear a pterodactyl using the bathroom? Because the P is silent.",
        "Did you know the first French fries weren't actually cooked in France? They were cooked in Greece.",
        "A doll was recently found dead in a rice paddy. It's the only known instance of a nick nack paddy wack.",
        "I saw an ad in a shop window, \"Television for sale, $1, volume stuck on full\", I thought, \"I can't turn that down\".",
        "R.I.P. boiled water. You will be mist.",
        "To the man in the wheelchair that stole my camouflage jacket; You can hide, but you can't run.",
        "How much does a hipster weigh? An instagram.",
        "Where are the Andes? At the end of your armies.",
        "A man was caught stealing in a supermarket today while balanced on the shoulders of a couple of vampires. He was charged with shoplifting on two counts. ",
        "I dreamed about drowning in an ocean made out of orange soda last night. It took me a while to work out it was just a Fanta sea.",
        "I invented a new word! Plagiarism!",
        "What do you call a fashionable lawn statue with an excellent sense of rhythmn? A metro-gnome",
        "A termite walks into a bar and asks “Is the bar tender here?”",
        "Do you want a brief explanation of what an acorn is? In a nutshell, it's an oak tree.",
        "Did you hear about the cheese who saved the world? It was Legend-dairy!",
        "Where do sheep go to get their hair cut? The baa-baa shop.",
        "I used to work in a shoe recycling shop. It was sole destroying.",
        "I started a new business making yachts in my attic this year...the sails are going through the roof",
        "What do you call a fish with no eyes? Fsh.",
        "Two guys walk into a bar, the third one ducks.",
        "It was raining cats and dogs the other day. I almost stepped in a poodle.",
        "What do you call a dictionary on drugs? High definition.",
        "To the guy who invented zero... thanks for nothing.",
        "What do you call your friend who stands in a hole? Phil.",
        "Our wedding was so beautiful, even the cake was in tiers.",
        "A cannibal is someone who is fed up with people.",
        "What do you call a careful wolf? Aware wolf.",
        "Why don't skeletons ride roller coasters? They don't have the stomach for it.",
        "What's the advantage of living in Switzerland? Well, the flag is a big plus.",
        "If you want a job in the moisturizer industry, the best advice I can give is to apply daily.",
        "What do you call a girl between two posts? Annette.",
        "Have you ever heard of a music group called Cellophane? They mostly wrap.",
        "What is bread's favorite number?  Leaven.",
        "How does a French skeleton say hello? Bone-jour.",
        "I met this girl on a dating site and, I don't know, we just clicked.",
        "What do computers and air conditioners have in common? They both become useless when you open windows.",
        "What did Michael Jackson name his denim store?    Billy Jeans!",
        "Can a kangaroo jump higher than the Empire State Building? Of course. The Empire State Building can't jump.",
        "How do you make a hankie dance? Put a little boogie in it.",
        "What's black and white and read all over? The newspaper.",
        "Ben & Jerry's really need to improve their operation. The only way to get there is down a rocky road.",
        "Two satellites decided to get married. The wedding wasn't much, but the reception was incredible.",
        "What did the green grape say to the purple grape? Breathe, you fool, breathe!",
        "What do you call a boy who stopped digging holes? Douglas.",
        "I adopted my dog from a blacksmith. As soon as we got home he made a bolt for the door.",
        "Without geometry life is pointless.",
        "I've been trying to come up with a dad joke about momentum . . . but I just can't seem to get it going.",
        "Did you hear about the guy whose whole left side was cut off? He's all right now.",
        "Doorbells, don't knock 'em.",
        "To the person who stole my anti-depressant pills: I hope you're happy now.",
        "I tried to write a chemistry joke, but could never get a reaction.",
        "The shovel was a ground-breaking invention.",
        "Whenever I want to start eating healthy, a chocolate bar looks at me and Snickers.",
        "Me: If humans lose the ability to hear high frequency volumes as they get older, can my 4 week old son hear a dog whistle?    Doctor: No, humans can never hear that high of a frequency no matter what age they are.    Me: Trick question... dogs can't whistle.",
        "My boss told me that he was going to fire the person with the worst posture. I have a hunch, it might be me.",
        "Whoever invented the knock-knock joke should get a no bell prize.",
        "Why did the chicken get a penalty? For fowl play.",
        "A panda walks into a bar and says to the bartender “I’ll have a Scotch and . . . . . . . . . . . . . . Coke thank you”.     “Sure thing” the bartender replies and asks “but what’s with the big pause?”     The panda holds up his hands and says “I was born with them”",
        "What time did the man go to the dentist? Tooth hurt-y.",
        "I used to be a banker but I lost interest",
        "Sometimes I tuck my knees into my chest and lean forward.  That’s just how I roll.",
        "Why are ghosts bad liars? Because you can see right through them!",
        "\"I'm sorry.\" \"Hi sorry, I'm dad\"",
        "What do you call a boomerang that won't come back? A stick.",
        "Who is the quickest draw in the ocean? Billy the Squid.",
        "I gave all my dead batteries away today, free of charge.",
        "Found out I was colour blind the other day... That one came right out the purple.",
        "A man got hit in the head with a can of Coke, but he was alright because it was a soft drink.",
        "Why are mummys scared of vacation? They're afraid to unwind.",
        "I’m on a whiskey diet. I’ve lost three days already.",
        "Whenever the cashier at the grocery store asks my dad if he would like the milk in a bag he replies, ‘No, just leave it in the carton!’",
        "My friend said to me: \"What rhymes with orange\" I said: \"no it doesn't\"",
        "I been watching a channel on TV that is strictly just about origami — of course it is paper-view.",
        "Breaking news! Energizer Bunny arrested – charged with battery.",
        "Americans can't switch from pounds to kilograms overnight. That would cause mass confusion.",
        "What's orange and sounds like a parrot? A Carrot.",
        "Why was the picture sent to prison? It was framed.",
        "What kind of tree fits in your hand? A palm tree!",
        "Why does Norway have barcodes on their battleships? So when they get back to port, they can Scandinavian.",
        "Did you know that ghosts call their true love their ghoul-friend?",
        "Why is the new Kindle screen textured to look like paper? So you feel write at home.",
        "As I suspected, someone has been adding soil to my garden. The plot thickens.",
        "My friend's bakery burned down last night. Now his business is toast.",
        "What did the traffic light say to the car as it passed? \"Don't look I'm changing!\"",
        "A police officer caught two kids playing with a firework and a car battery. He charged one and let the other one off.",
        "I have the heart of a lion... and a lifetime ban from the San Diego Zoo.",
        "Want to hear my pizza joke? Never mind, it's too cheesy.",
        "What do you call a bee that lives in America? A USB.",
        "What lies at the bottom of the ocean and twitches? A nervous wreck.",
        "What does a clock do when it's hungry? It goes back four seconds!",
        "Where do rabbits go after they get married? On a bunny-moon.",
        "Just watched a documentary about beavers… It was the best damn program I’ve ever seen.",
        "What do you call a pile of cats?  A Meowtain.",
        "What do Alexander the Great and Winnie the Pooh have in common? Same middle name.",
        "I heard there was a new store called Moderation. They have everything there",
        "How does the moon cut his hair? Eclipse it.",
        "Did you hear the one about the guy with the broken hearing aid? Neither did he.",
        "You know that cemetery up the road? People are dying to get in there.",
        "What did the father tomato say to the baby tomato whilst on a family walk? Ketchup.",
        "They're making a movie about clocks. It's about time",
        "What do you call an elephant that doesn’t matter? An irrelephant.",
        "I'm tired of following my dreams. I'm just going to ask them where they are going and meet up with them later.",
        "Why are pirates called pirates? Because they arrr!",
        "Why was the big cat disqualified from the race? Because it was a cheetah.",
        "People who don't eat gluten are really going against the grain.",
        "What kind of dog lives in a particle accelerator? A Fermilabrador Retriever.",
        "What do you call an Argentinian with a rubber toe? Roberto",
        "What did the shy pebble wish for? That she was a little boulder.",
        "Thanks for explaining the word \"many\" to me. It means a lot.",
        "Two parrots are sitting on a perch. One turns to the other and asks, \"do you smell fish?\"",
        "What do you call a cow on a trampoline? A milk shake!",
        "Did you hear about the new restaurant on the moon? The food is great, but there's just no atmosphere.",
        "What do you call a magician who has lost their magic? Ian.",
        "Last night me and my girlfriend watched three movies back to back. Luckily I was the one facing the TV.",
        "Why do bananas have to put on sunscreen before they go to the beach? Because they might peel!",
        "How do you get a baby alien to sleep?  You rocket.",
        "My son asked me to stop singing Oasis songs in public. I said maybe.",
        "Why do cows wear bells? Because their horns don't work.",
        "What did celery say when he broke up with his girlfriend? She wasn't right for me, so I really don't carrot all.",
        "For Valentine's day, I decided to get my wife some beads for an abacus.  It's the little things that count.",
        "Where do hamburgers go to dance? The meat-ball.",
        "I was wondering why the frisbee was getting bigger, then it hit me.",
        "What did the piece of bread say to the knife? Butter me up.",
        "Sore throats are a pain in the neck!",
        "The biggest knight at King Arthur's round table was Sir Cumference. He acquired his size from eating too much pi.",
        "I'd like to start a diet, but I've got too much on my plate right now.",
        "Why is no one friends with Dracula? Because he's a pain in the neck.",
        "How can you tell a vampire has a cold? They start coffin.",
        "When Dad drops a pea off of his plate ‘oh dear I’ve pee’d on the table!",
        "I was going to learn how to juggle, but I didn't have the balls.",
        "What's the worst part about being a cross-eyed teacher?    They can't control their pupils.",
        "People keep making apocalypse jokes like there's no tomorrow.",
        "I’ve deleted the phone numbers of all the Germans I know from my mobile phone. Now it’s Hans free.",
        "Why can't a bicycle stand on its own? It's two-tired.",
        "Do you know where you can get chicken broth in bulk? The stock market.",
        "What do you call a fake noodle? An impasta.",
        "Why did Dracula lie in the wrong coffin? He made a grave mistake.",
        "Why did the tree go to the dentist? It needed a root canal.",
        "Yesterday I confused the words \"jacuzzi\" and \"yakuza\". Now I'm in hot water with the Japanese mafia.",
        "Why did the coffee file a police report? It got mugged.",
        "What is Beethoven's favorite fruit? A ba-na-na-na.",
        "The price of bouncy castles have doubled this year. That's inflation for you.",
        "Which side of the chicken has more feathers? The outside.",
        "People saying 'boo! to their friends has risen by 85% in the last year.... That's a frightening statistic.",
        "Why couldn't the lifeguard save the hippie? He was too far out, man.",
        "What kind of music do mummy's like? Rap",
        "Have you heard the rumor going around about butter? Never mind, I shouldn't spread it.",
        "Two muffins were sitting in an oven, and the first looks over to the second, and says, “man, it’s really hot in here”. The second looks over at the first with a surprised look, and answers, “WHOA, a talking muffin!”",
        "I gave my friend 10 puns hoping that one of them would make him laugh. Sadly, no pun in ten did.",
        "My cat was just sick on the carpet, I don’t think it’s feline well.",
        "Two peanuts were walking down the street. One was a salted.",
        "I bought shoes from a drug dealer once. I don't know what he laced them with, but I was tripping all day.",
        "What did the fish say when it swam into a wall? Damn!",
        "Dad, can you put my shoes on? I don't think they'll fit me.",
        "Last night me and my girlfriend watched three DVDs back to back. Luckily I was the one facing the TV.",
        "What’s E.T. short for? He’s only got little legs.",
        "What did the Buffalo say to his little boy when he dropped him off at school? Bison.",
        "Why is the ocean always blue? Because the shore never waves back.",
        "How do you find Will Smith in the snow?  Look for fresh prints.",
        "What did one nut say as he chased another nut?  I'm a cashew!",
        "What do I look like? A JOKE MACHINE!?",
        "Two guys walked into a bar, the third one ducked.",
        "Did you hear the news? FedEx and UPS are merging. They’re going to go by the name Fed-Up from now on.",
        "What did the ocean say to the beach? Thanks for all the sediment.",
        "What do you call two barracuda fish?  A Pairacuda!",
        "Why did the melons plan a big wedding? Because they cantaloupe!",
        "What concert costs only 45 cents? 50 cent featuring Nickelback.",
        "Why don’t skeletons ever go trick or treating? Because they have nobody to go with.",
        "What do you get if you put a duck in a cement mixer? Quacks in the pavement.",
        "You will never guess what Elsa did to the balloon. She let it go.",
        "Don’t interrupt someone working intently on a puzzle. Chances are, you’ll hear some crosswords.",
        "Why can't your nose be 12 inches long? Because then it'd be a foot!",
        "What cheese can never be yours? Nacho cheese.",
        "I really want to buy one of those supermarket checkout dividers, but the cashier keeps putting it back.",
        "What is this movie about? It is about 2 hours long.",
        "How are false teeth like stars? They come out at night!",
        "I wouldn't buy anything with velcro. It's a total rip-off.",
        "I just got fired from a florist, apparently I took too many leaves.",
        "What is worse then finding a worm in your Apple? Finding half a worm in your Apple.",
        "How do you find Will Smith in the snow? You look for the fresh prints.",
        "Have you heard of the band 1023MB? They haven't got a gig yet.",
        "In the news a courtroom artist was arrested today, I'm not surprised, he always seemed sketchy.",
        "Why don't sharks eat clowns?  Because they taste funny.",
        "People are making apocalypse jokes like there’s no tomorrow.",
        "Who did the wizard marry? His ghoul-friend",
        "What did the grape do when he got stepped on? He let out a little wine.",
        "I've deleted the phone numbers of all the Germans I know from my mobile phone. Now it's Hans free.",
        "Which is the fastest growing city in the world? Dublin'",
        "Past, present, and future walked into a bar.... It was tense.",
        "Today a girl said she recognized me from vegetarian club, but I’m sure I’ve never met herbivore.",
        "How many bones are in the human hand? A handful of them.",
        "What do you call a pig with three eyes? Piiig",
        "Where does Fonzie like to go for lunch? Chick-Fil-Eyyyyyyyy.",
        "Why was Santa's little helper feeling depressed? Because he has low elf esteem. ",
        "What do you get if you drop a piano down a coal shaft? A flat minor.",
        "Whiteboards ... are remarkable.",
        "Why did the belt go to prison? He held up a pair of pants!",
        "What are the strongest days of the week? Saturday and Sunday...the rest are weekdays.",
        "I thought my wife was joking when she said she'd leave me if I didn't stop signing \"I'm A Believer\"... Then I saw her face.",
        "I cut my finger cutting cheese. I know it may be a cheesy story but I feel grate now.",
        "Why can't eggs have love? They will break up too soon.",
        "I don’t play soccer because I enjoy the sport. I’m just doing it for kicks.",
        "I went to the doctor today and he told me I had type A blood, but it was a type O.",
        "My New Years resolution is to stop leaving things so late.",
        "What did the beaver say to the tree? It's been nice gnawing you.",
        "Why did the half blind man fall in the well? Because he couldn't see that well!",
        "At the boxing match, the dad got into the popcorn line and the line for hot dogs, but he wanted to stay out of the punchline.",
        "How did Darth Vader know what Luke was getting for Christmas? He felt his presents.",
        "How come a man driving a train got struck by lightning? He was a good conductor.",
        "My first time using an elevator was an uplifting experience. The second time let me down.",
        "What do you call someone with no nose? Nobody knows.",
        "I needed a password eight characters long so I picked Snow White and the Seven Dwarfs.",
        "I used to be a banker, but I lost interest.",
        "I got fired from the transmission factor, turns out I didn't put on enough shifts...",
        "A magician was driving down the street and then he turned into a driveway.",
        "I went on a date last night with a girl from the zoo. It was great. She’s a keeper.",
        "Child: Dad, make me a sandwich. Dad: Poof! You're a sandwich.",
        "What did the late tomato say to the early tomato? I’ll ketch up",
        "The great thing about stationery shops is they're always in the same place...",
        "What did the judge say to the dentist? Do you swear to pull the tooth, the whole tooth and nothing but the tooth?",
        "What did the pirate say on his 80th birthday? Aye matey",
        "Guy told me today he did not know what cloning is. I told him, \"that makes 2 of us.\"",
        "Why was the robot angry? Because someone kept pressing his buttons!",
        "Why did the cowboy have a weiner dog? Somebody told him to get a long little doggy.",
        "What was Beethoven's fifth favorite fruit? Ba-na-na-na.",
        "Geology rocks, but Geography is where it's at!",
        "My wife is on a tropical food diet, the house is full of the stuff. It's enough to make a mango crazy.",
        "“Doctor, I’ve broken my arm in several places” Doctor “Well don’t go to those places.”",
        "This furniture store keeps emailing me, all I wanted was one night stand!",
        "What do you call a sketchy Italian neighbourhood? The Spaghetto.",
        "Why did the man put his money in the freezer? He wanted cold hard cash!",
        "The first time I got a universal remote control I thought to myself, \"This changes everything\"",
        "Nurse: Doctor, there's a patient that says he's invisible. Doctor: Well, tell him I can't see him right now!",
        "What’s the longest word in the dictionary? Smiles. Because there’s a mile between the two S’s.",
        "What do you do when your bunny gets wet? You get your hare dryer.",
        "Why did Mozart kill all his chickens?  Because when he asked them who the best composer was, they'd all say \"Bach bach bach!\"  ",
        "What do you call cheese by itself? Provolone.",
        "Me and my mates are in a band called Duvet. We're a cover band.",
        "Hostess: Do you have a preference of where you sit?  Dad: Down.",
        "I wish I could clean mirrors for a living. It's just something I can see myself doing.",
        "How many tickles does it take to tickle an octopus? Ten-tickles!",
        "What's the best thing about elevator jokes? They work on so many levels.",
        "Why couldn't the kid see the pirate movie? Because it was rated arrr!",
        "What has twenty legs and flies? Ten pairs of pants.",
        "What happens to a frog's car when it breaks down? It gets toad.",
        "How do you make Lady Gaga cry? Poker face. ",
        "I ordered a chicken and an egg from Amazon. I'll let you know.",
        "Shout out to my grandma, that's the only way she can hear.",
        "I had a dream that I was a muffler last night. I woke up exhausted.",
        "I'm glad I know sign language, it's pretty handy.",
        "If you walk into a forest and cut down a tree, but the tree doesn't understand why you cut it down, do you think it's stumped?",
        "I was in an 80's band called the prevention. We were better than the cure.",
        "Why is there always a gate around cemeteries? Because people are always dying to get in.",
        "The best time on a clock is 6:30--hands down.",
        "My pet mouse 'Elvis' died last night. He was caught in a trap..",
        "When the window fell into the incinerator, it was a pane in the ash to retrieve.",
        "Why did the Clydesdale give the pony a glass of water?  Because he was a little horse!",
        "What do you call an eagle who can play the piano? Talonted!",
        "Why are oranges the smartest fruit? Because they are made to concentrate. ",
        "What’s Forest Gump’s Facebook password? 1forest1",
        "What do you call a gorilla wearing headphones? Anything you'd like, it can't hear you.",
        "I decided to sell my Hoover… well it was just collecting dust.",
        "The word queue is ironic. It's just q with a bunch of silent letters waiting in line.",
        "What’s the advantage of living in Switzerland? Well, the flag is a big plus.",
        "I went to the doctor today and he told me I had type A blood but it was a type O.",
        "what do you call a dog that can do magic tricks? a labracadabrador",
        "Why did the burglar hang his mugshot on the wall? To prove that he was framed!",
        "What do you call a troublesome Canadian high schooler? A poutine.",
        "Did you know that protons have mass? I didn't even know they were catholic.",
        "I was going to get a brain transplant, but I changed my mind",
        "I used to hate facial hair, but then it grew on me.",
        "What do you call a man with a rug on his head? Matt.",
        "Feeling pretty proud of myself. The Sesame Street puzzle I bought said 3-5 years, but I finished it in 18 months.",
        "I went to a Foo Fighters Concert once... It was Everlong...",
        "I used to work for an origami company but they folded.",
        "If you think swimming with dolphins is expensive, you should try swimming with sharks--it cost me an arm and a leg!",
        "Why did the scarecrow win an award? Because he was outstanding in his field.",
        "Bad at golf? Join the club.",
        "How many optometrists does it take to change a light bulb? 1 or 2? 1... or 2?",
        "Why did the feline fail the lie detector test? Because he be lion.",
        "What do you call a beehive without the b's? An eehive.",
        "Dad died because he couldn't remember his blood type. I will never forget his last words. Be positive.",
        "A Skeleton walked into a bar he said I need a beer and a mop",
        "Milk is also the fastest liquid on earth – its pasteurized before you even see it",
        "In my career as a lumberjack I cut down exactly 52,487 trees. I know because I kept a log.",
        "I got fired from a florist, apparently I took too many leaves.",
        "Today, my son asked \"Can I have a book mark?\" and I burst into tears. 11 years old and he still doesn't know my name is Brian.",
        "Why don’t seagulls fly over the bay? Because then they’d be bay-gulls!",
        "I hate perforated lines, they're tearable.",
        "Why should you never trust a pig with a secret? Because it's bound to squeal.",
        "I have kleptomania, but when it gets bad, I take something for it.",
        "What's the difference between a well dressed man on a a bicycle and a poorly dressed man on a tricycle? Attire!",
        "What happens when you anger a brain surgeon? They will give you a piece of your mind.",
        "I broke my finger at work today, on the other hand I'm completely fine.",
        "Chances are if you' ve seen one shopping center, you've seen a mall.",
        "A beekeeper was indicted after he confessed to years of stealing at work. They charged him with emBEEzlement",
        "My dentist is the best, he even has a little plaque!",
        "I asked a frenchman if he played video games. He said \"Wii\"",
        "What do you call a guy lying on your doorstep? Matt.",
        "Parallel lines have so much in common. It’s a shame they’ll never meet.",
        "What do you call a fat psychic? A four-chin teller.",
        "Why was ten scared of seven? Because seven ate nine.",
        "I used to think I was indecisive, but now I'm not sure.",
        "The other day, my wife asked me to pass her lipstick but I accidentally passed her a glue stick. She still isn't talking to me.",
        "Where are average things built? In the satisfactory.",
        "I went to a book store and asked the saleswoman where the Self Help section was, she said if she told me it would defeat the purpose.",
        "Why did the man run around his bed? Because he was trying to catch up on his sleep!",
        "I had a pair of racing snails. I removed their shells to make them more aerodynamic, but they became sluggish.",
        "What's the difference between a jeweller and a prison warden? One sells watches, and the other watches cells.",
        "What do you get when you cross a snowman with a vampire? Frostbite.",
        "If you’re struggling to think of what to get someone for Christmas. Get them a fridge and watch their face light up when they open it.",
        "What's red and bad for your teeth? A Brick.",
        "What did the dog say to the two trees? Bark bark.",
        "What do you call a cow with no legs? Ground beef.",
        "I couldn't figure out how the seat belt worked. Then it just clicked.",
        "How do you count cows? A 'Cow'culator",
        "Sgt.: Commissar! Commissar! The troops are revolting! Commissar: Well, you’re pretty repulsive yourself.",
        "What kind of dinosaur loves to sleep? A stega-snore-us.",
        "Why does a Moon-rock taste better than an Earth-rock? Because it's a little meteor.",
        "Why are fish easy to weigh? Because they have their own scales.",
        "Why did Sweden start painting barcodes on the sides of their battleships? So they could Scandinavian.",
        "My sea sickness comes in waves.",
        "What do you give a sick lemon? Lemonaid.",
        "What do you call a cow with two legs? Lean beef.",
        "Did you hear about the bread factory burning down? They say the business is toast.",
        "I just wrote a book on reverse psychology. Do not read it!",
        "A horse walks into a bar. The bar tender says \"Hey.\" The horse says \"Sure.\"",
        "How do you make toast in the jungle? Pop your bread under a g'rilla.",
        "I thought about going on an all-almond diet. But that's just nuts.",
        "Why do trees seem suspicious on sunny days? Dunno, they're just a bit shady.",
        "Why is Peter Pan always flying? Because he Neverlands.",
        "Why can’t you hear a pterodactyl go to the bathroom? The p is silent.",
        "Why does Superman get invited to dinners? Because he is a Supperhero.",
        "What is the leading cause of dry skin? Towels",
        "What do you call a droid that takes the long way around? R2 detour.",
        "Toasters were the first form of pop-up notifications.",
        "What did the calculator say to the student? You can count on me.",
        "What's brown and sticky? A stick.",
        "What do you call a crowd of chess players bragging about their wins in a hotel lobby? Chess nuts boasting in an open foyer.",
        "I’m reading a book on the history of glue – can’t put it down.",
        "Why did the opera singer go sailing? They wanted to hit the high Cs.",
        "How do locomotives know where they're going? Lots of training",
        "What has twenty legs and flies? Five dead Horses.",
        "They laughed when I said I wanted to be a comedian – they’re not laughing now.",
        "If a child refuses to sleep during nap time, are they guilty of resisting a rest?",
        "Did you hear about the campsite that got visited by Bigfoot? It got in tents.",
        "Why do bakers work so hard? They knead the dough.",
        "It’s hard to explain puns to kleptomaniacs, because they take everything literally."
    ],
    "dev_jokes.dialog": [
        "Complaining about the lack of smoking shelters, the nicotine addicted Python programmers said there ought to be 'spaces for tabs'.",
        "Ubuntu users are apt to get this joke.",
        "Obfuscated Reality Mappers (ORMs) can be useful database tools.",
        "Asked to explain Unicode during an interview, Geoff went into detail about his final year university project. He was not hired.",
        "Triumphantly, Beth removed Python 2.7 from her server in 2030. 'Finally!' she said with glee, only to see the announcement for Python 4.4.",
        "An SQL query goes into a bar, walks up to two tables and asks, 'Can I join you?'",
        "When your hammer is C++, everything begins to look like a thumb.",
        "If you put a million monkeys at a million keyboards, one of them will eventually write a Java program. The rest of them will write Perl.",
        "To understand recursion you must first understand recursion.",
        "I suggested holding a 'Python Object Oriented Programming Seminar', but the acronym was unpopular.",
        "'Knock, knock.' 'Who's there?' ... very long pause ... 'Java.'",
        "How many programmers does it take to change a lightbulb? None, that's a hardware problem.",
        "What's the object-oriented way to become wealthy? Inheritance.",
        "Why don't jokes work in octal? Because 7 10 11.",
        "How many programmers does it take to change a lightbulb? None, they just make darkness a standard.",
        "Two bytes meet. The first byte asks, 'Are you ill?' The second byte replies, 'No, just feeling a bit off.'",
        "Two threads walk into a bar. The barkeeper looks up and yells, 'Hey, I want don't any conditions race like time last!'",
        "Old C programmers don't die, they're just cast into void.",
        "Eight bytes walk into a bar. The bartender asks, 'Can I get you anything?' 'Yeah,' replies the bytes. 'Make us a double.'",
        "Why did the programmer quit his job? Because he didn't get arrays.",
        "Why do Java programmers have to wear glasses? Because they don't see sharp.",
        "Software developers like to solve problems. If there are no problems handily available, they will create their own.",
        ".NET was named .NET so that it wouldn't show up in a Unix directory listing.",
        "Hardware: The part of a computer that you can kick.",
        "A programmer was found dead in the shower. Next to their body was a bottle of shampoo with the instructions 'Lather, Rinse and Repeat'.",
        "Optimist: The glass is half full. Pessimist: The glass is half empty. Programmer: The glass is twice as large as necessary.",
        "In C we had to code our own bugs. In C++ we can inherit them.",
        "How come there is no obfuscated Perl contest? Because everyone would win.",
        "If you play a Windows CD backwards, you'll hear satanic chanting ... worse still, if you play it forwards, it installs Windows.",
        "How many programmers does it take to kill a cockroach? Two: one holds, the other installs Windows on it.",
        "What do you call a programmer from Finland? Nerdic.",
        "What did the Java code say to the C code? A: You've got no class.",
        "Why did Microsoft name their search engine BING? Because It's Not Google.",
        "Pirates go 'arg!', computer pirates go 'argv!'",
        "Software salesmen and used-car salesmen differ in that the latter know when they are lying.",
        "Child: Dad, why does the sun rise in the east and set in the west? Dad: Son, it's working, don't touch it.",
        "Why do programmers confuse Halloween with Christmas? Because OCT 31 == DEC 25.",
        "How many Prolog programmers does it take to change a lightbulb? false.",
        "Real programmers can write assembly code in any language.",
        "Waiter: Would you like coffee or tea? Programmer: Yes.",
        "What do you get when you cross a cat and a dog? Cat dog sin theta.",
        "If loving you is ROM I don't wanna read write.",
        "A programmer walks into a foo...",
        "A programmer walks into a bar and orders 1.38 root beers. The bartender informs her it's a root beer float. She says 'Make it a double!'",
        "What is Benoit B. Mandelbrot's middle name? Benoit B. Mandelbrot.",
        "Why are you always smiling? That's just my... regular expression.",
        "ASCII stupid question, get a stupid ANSI.",
        "A programmer had a problem. He thought to himself, 'I know, I'll solve it with threads!'. has Now problems. two he",
        "Why do sin and tan work? Just cos.",
        "Java: Write once, run away.",
        "I would tell you a joke about UDP, but you would never get it.",
        "A QA engineer walks into a bar. Runs into a bar. Crawls into a bar. Dances into a bar. Tiptoes into a bar. Rams a bar. Jumps into a bar.",
        "My friend's in a band called '1023 Megabytes'... They haven't got a gig yet!",
        "I had a problem so I thought I'd use Java. Now I have a ProblemFactory.",
        "QA Engineer walks into a bar. Orders a beer. Orders 0 beers. Orders 999999999 beers. Orders a lizard. Orders -1 beers. Orders a sfdeljknesv.",
        "A product manager walks into a bar, asks for drink. Bartender says no, but will consider adding later.",
        "How do you generate a random string? Put a first year Computer Science student in Vim and ask them to save and exit.",
        "I've been using Vim for a long time now, mainly because I can't figure out how to exit.",
        "How do you know whether a person is a Vim user? Don't worry, they'll tell you.",
        "Waiter: He's choking! Is anyone a doctor? Programmer: I'm a Vim user.",
        "3 Database Admins walked into a NoSQL bar. A little while later they walked out because they couldn't find a table.",
        "How to explain the movie Inception to a programmer? When you run a VM inside another VM, inside another VM ... everything runs real slow!",
        "What do you call a parrot that says \"Squawk! Pieces of nine! Pieces of nine!\"? A parrot-ey error.",
        "There are only two hard problems in Computer Science: cache invalidation, naming things and off-by-one-errors.",
        "There are 10 types of people: those who understand binary and those who don't.",
        "There are 2 types of people: those who can extrapolate from incomplete data sets...",
        "There are II types of people: Those who understand Roman Numerals and those who don't.",
        "There are 10 types of people: those who understand hexadecimal and 15 others.",
        "There are 10 types of people: those who understand binary, those who don't, and those who were expecting this joke to be in trinary.",
        "There are 10 types of people: those who understand trinary, those who don't, and those who have never heard of it.",
        "What do you call eight hobbits? A hobbyte.",
        "The best thing about a Boolean is even if you are wrong, you are only off by a bit.",
        "A good programmer is someone who always looks both ways before crossing a one-way street.",
        "There are two ways to write error-free programs; only the third one works.",
        "QAs consist of 55% water, 30% blood and 15% Jira tickets.",
        "Sympathy for the Devil is really just about being nice to QAs.",
        "How many QAs does it take to change a lightbulb? They noticed that the room was dark. They don't fix problems, they find them.",
        "A programmer crashes a car at the bottom of a hill, a bystander asks what happened, he says \"No idea. Let's push it back up and try again\".",
        "What do you mean 911 is only for emergencies? I've got a merge conflict.",
        "Writing PHP is like peeing in the swimming pool, everyone did it, but we don't need to bring it up in public.",
        "Why did the QA cross the road? To ruin everyone's day.",
        "Number of days since I have encountered an array index error: -1.",
        "Number of days since I have encountered an off-by-one error: 0.",
        "Speed dating is useless. 5 minutes is not enough to properly explain the benefits of the Unix philosophy.",
        "Microsoft hold a bi-monthly internal \"productive week\" where they use Google instead of Bing.",
        "Schrodinger's attitude to web development: If I don't look at it in Internet Explorer then there's a chance it looks fine.",
        "Finding a good PHP developer is like looking for a needle in a haystack. Or is it a hackstack in a needle?",
        "Unix is user friendly. It's just very particular about who its friends are.",
        "A COBOL programmer makes millions with Y2K remediation and decides to get cryogenically frozen. \"The year is 9999. You know COBOL, right?\"",
        "The C language combines all the power of assembly language with all the ease-of-use of assembly language.",
        "An SEO expert walks into a bar, bars, pub, public house, Irish pub, tavern, bartender, beer, liquor, wine, alcohol, spirits...",
        "What does 'Emacs' stand for? 'Exclusively used by middle aged computer scientists.'",
        "What does pyjokes have in common with Adobe Flash? It gets updated all the time, but never gets any better.",
        "Why does Waldo only wear stripes? Because he doesn't want to be spotted.",
        "I went to a street where the houses were numbered 8k, 16k, 32k, 64k, 128k, 256k and 512k. It was a trip down Memory Lane.",
        "!false, (It's funny because it's true)",
        "['hip', 'hip'] (hip hip array!)",
        "Programmer: The ship I boarded crashed and I am dying! Project Manager: Then let's do a quick knowledge transfer session before you go.",
        "Are you a RESTful API? because you GET my attention, PUT some love, POST the cutest smile, and DELETE my bad day.",
        "I used to know a joke about Java, but I run out of memory.",
        "My girlfriend dumped me after I named a class after her. She felt I treated her like an object.",
        "Girl: Do you drink? Programmer: No. Girl: Have Girlfriend? Programmer: No. Girl: Then how do you enjoy life? Programmer: I am Programmer",
        "A Programmer was walking out of door for work, his wife said \"while you're out, buy some milk\" and he never returned.",
        "A: What is your address? Me: 173.168.15.10 A: No, your local address Me: 127.0.0.1 A: I mean your physical address B: 29:01:38:62:31:58",
        "Why do programmers always mix up Halloween and Christmas? Because Oct 31 equals Dec 25.",
        "Programming is 10% science, 20% ingenuity, and 70% getting the ingenuity to work with the science.",
        "There are three kinds of lies: Lies, damned lies, and benchmarks.",
        "All programmers are playwrights, and all computers are lousy actors.",
        "Have you heard about the new Cray super computer? It's so fast, it executes an infinite loop in 6 seconds.",
        "The generation of random numbers is too important to be left to chance.",
        "I just saw my life flash before my eyes and all I could see was a close tag.",
        "The computer is mightier than the pen, the sword, and usually, the programmer",
        "Debugging: Removing the needles from the haystack.",
        "If doctors were like software engineers, they would say things like Have you tried killing yourself and being reborn?",
        "Debugging is like being the detective in a crime drama where you are also the murderer.",
        "The best thing about a Boolean is that even if you are wrong, you are only off by a bit.",
        "If you listen to a UNIX shell, can you hear the C?",
        "Why do Java programmers have to wear glasses? Because they don't C#.",
        "When Apple employees die, does their life HTML5 in front of their eyes?",
        "What did the router say to the doctor? It hurts when IP.",
        "Learning JavaScript is like looking both ways before you cross the street, and then getting hit by an airplane.",
        "I for one am excited for the days when dereferencing a null pointer causes an aneurysm.",
        "Debugging is like an onion. There are multiple layers to it, and the more you peel them back.",
        "When your code does not change color automatically, Something's wrong, I can feel it.",
        "I have a joke on programming but it only works on my computer.",
        "Why do you always use i and j variales in loops? It's the law......",
        "As far as we know, our computer has never had an undetected error.",
        "A user friendly computer first requires a friendly user.",
        "Bug? That's not a bug, that's a feature.",
        "Buy a Pentium 586/200 so you can reboot faster.",
        "Computer analyst to programmer: You start coding. I'll go find out what they want.",
        "Computer programmers do it byte by byte.",
        "Don't compute and drive; the life you save may be your own.",
        "How an engineer writes a program: Start by debugging an empty file...",
        "If at first you don't succeed, call it version 1.0.",
        "I have a dream: 1073741824 bytes free.",
        "I haven't lost my mind; it's backed up on tape somewhere.",
        "Is reading in the bathroom considered Multi-Tasking.",
        "Never say 'OOPS!' always say 'Ah, Interesting!'",
        "One person's error is another person's data.",
        "Press CTRL-ALT-DEL to continue....",
        "Programmer's Time-Space Continuum: Programmers continuously space the time.",
        "Speed Kills! Use Windows.",
        "The box said: 'install on Windows 95, NT 4.0 or better'. So I installed it on Linux.",
        "The program is absolutely right; therefore the computer must be wrong.",
        "There are only 10 types of people in this world: those who understand binary, and those who don't.",
        "There were computers in Biblical times. Eve had an Apple.",
        "Those who can, do. Those who cannot, teach. Those who cannot teach, HACK!",
        "User error: replace user and press any key to continue.",
        "Warning, keyboard not found. Press Enter to continue.",
        "Why do they call this a word processor? It's simple, ... you've seen what food processors do to food, right?",
        "Why do we want intelligent terminals when there are so many stupid users?",
        "Windows is NOT a virus. Viruses DO something.",
        "WINDOWS stands for Will Install Needless Data On Whole System.",
        "You are making progress if each mistake is a new one.",
        "You had mail, but the super-user read it, and deleted it!",
        "You never finish a program, you just stop working on it.",
        "You don't have to know how the computer works, just how to work the computer.",
        "You forgot to do your backup 16 days ago. Tomorrow you'll need that version.",
        "I love pressing the F5 key. It's refreshing.",
        "My favourite computer based band is the Black IPs.",
        "Why was the developer bankrupt? He'd used all his cache.",
        "A friend is in a band called 1023Mb. They haven't had a gig yet.",
        "Apparently my password needs to be capitals only so I've changed it to LONDONMADRIDROME",
        "I changed my password to BeefStew but the computer told me it wasn't Stroganoff.",
        "Changed my password to fortnight but apparently that's two week.",
        "Artificial intelligence usually beats real stupidity.",
        "The Internet: where men are men, women are men, and children are FBI agents.",
        "Bugs come in through open Windows.",
        "Unix is user friendly. It's just selective about who its friends are.",
        "Failure is not an option. It comes bundled with your Microsoft product.",
        "Computers are like air conditioners: they stop working when you open Windows.",
        "Beware of programmers that carry screwdrivers.",
        "I'm not anti-social; I'm just not user friendly.",
        "Hey! It compiles! Ship it!",
        "If Ruby is not and Perl is the answer, you don't understand the question.",
        "My attitude isn't bad. It's in beta.",
        "Programmers are tools for converting caffeine into code.",
        "There are three kinds of people: those who can count and those who can't.",
        "Why do programmers prefer dark mode? Because light attracts bugs.",
        "The webmaster is filling out a questionnaire: Age: 25 Height: 185 Eye color: #4040FF",
        "Do you know why blonde programmers place cheese next to a computer? So the mouse has something to eat!",
        "I married a programmer. When I asked him how to open a .jar file, he told me to download Java",
        "A moment ago I experienced the fastest data transfer of my life, 256 GB per second. The vacuum cleaner sucked up the flash drive.",
        "The grandson shouts: Grandma, let’s buy a PlayStation! The grandmother replies: Buy whatever you want, I’m not going to feed it!",
        "And God said: Noah, make a backup... I’m going to format.",
        "Do you know what Windows does on the Moon? It crashes 6 times slower.",
        "Two admins are talking: My buddy crashed the main server in 5 minutes yesterday. Is he a hacker? No, an idiot.",
        "Two graphic designers are talking: I picked up a new girlfriend, and she's beautiful, she has 90-60-90. What? Dark purple?",
        "He who laughs last, has the highest ping.",
        "Women are like internet domains. The best ones are already taken. But there’s always a chance to find one from an exotic country.",
        "They asked me if I even have friends. Of course I do. All the episodes.",
        "What does a programmer yell when they’re drowning? F1, F1, F1!",
        "Do you know the one where a programmer comes to the gym on Sunday morning?",
        "A hacker comes to a priest and says: Father, I have sinned. And how much did you do? Well, it fit on two floppy disks!",
        "The three biggest disasters in human history: Hiroshima 45, Chernobyl 86, Windows 95.",
        "The server is crashing, make a wish!",
        "What hardware runs Windows 98 best on? A slide projector.",
        "The world is binary. Either you’re a one or a zero.",
        "An IT person is someone who wonders why a kilo of meat doesn’t weigh 1024 grams.",
        "Sometimes it’s better to stay in bed on Monday than to spend the whole week debugging Monday's code.",
        "Everyone tells me that my cat's name isn’t a good password for root. But I’ve already gotten used to my qzb!7kw_2et!",
        "The problem with UDP jokes is that you never know if they ran out on people.",
        "Am I up next with the Token-ring joke?",
        "The problem with CSS jokes is that everyone understands them a little differently.",
        "An IPv6 packet walks into a bar. No one talks to it.",
        "A multicast packet walks into a bar and leaves through four exits at the same time.",
        "How many programmers does it take to change a lightbulb? None. It’s a hardware problem.",
        "Which place in Prague is named after the Internet? I.P. Pavlova Square.",
        "What does one bit say to the other? See you in the bus!",
        "What is a therapist? - 1024 Gigatherapist.",
        "What Pokémon has a machine gun? Ratatatatatatatatata",
        "What is Internet Explorer for? To download Google Chrome.",
        "Optimist: The glass is half full. Pessimist: The glass is half empty. Programmer: The glass is twice as big as necessary.",
        "Where do programmers usually go out? Foo Bar",
        "How do you compare HTML and HTML5? Does it work with Internet Explorer? No? It’s HTML5.",
        "Real programmers count from 0.",
        "It’s the story of a programmer who walks into a bar and says, \"Hello World.\"",
        "Three SQL databases walk into a NoSQL bar. After a while, they leave because they couldn’t find a table.",
        "An SQL query walks into a bar, sits at two tables, and asks: \"Can I join you?\"",
        "If it says: This software requires Windows XP or better, does that mean it can run on Linux?",
        "I would like to create a better world, but no one will give me the source code.",
        "Never copy and paste an entire function. Always create a new method.",
        "C++ says to C: \"Come on! You don’t have a class.\"",
        "C++ says to C: \"Why don’t you ever come to class?\"",
        "There are 2 types of programmers. 1) I am God. 2) I have no idea what I’m doing.",
        "There are 10 types of people: those who know how to count in binary, and the others.",
        "If Microsoft invented something that doesn’t crash, it would be a nail.",
        "How many programmers does it take to change a lightbulb? None, it’s a hardware problem.",
        "What’s the difference between Windows XP and a virus? The virus works without help.",
        "What’s the difference between Bill Gates and God? God doesn’t think he’s Bill Gates.",
        "A programmer says to another programmer: \"I don’t understand, it worked last Wednesday.\"",
        "An experienced programmer always asks questions when the code compiles the first time.",
        "Knock Knock. Who’s there? Long pause It’s Internet Explorer.",
        "It’s the story of an administrator configuring his environment variables, and then... PATH the way!",
        "A teacher tells his students that to succeed, they should not rely on a search engine... The programmer laughs loudly!",
        "A programmer will always ask: \"It doesn’t work, why?\" and \"It works, why?\"",
        "The elevator opens and a programmer is inside. They ask: Up or down? The programmer replies: - Yes.",
        "What does one bit say to another? See you on the bus.",
        "Robber: Your money or your life! Programmer: Sorry, I’m a programmer. Robber: So? Programmer: I have neither money nor life.",
        "What’s a therapist? - 1024 gigatherapists.",
        "How many programmers does it take to change a lightbulb? - None, it’s a hardware problem.",
        "The curtain opens, a computer scientist appears, and says: What did you touch? The curtain won’t close!",
        "A person dies while studying in the library. - What was she studying? - The Windows API.",
        "What does a GIF say to a PNG? - Get moving, man...",
        "What does a computer scientist shout while drowning at the beach? F1, F1!",
        "There are only 10 types of people in the world, those who understand binary and those who don’t.",
        "There are only 10 types of people in the world, those who understand ternary, those who don’t, and those who confuse it with binary.",
        "A woman tells her husband: - Go to the store and bring a loaf of bread, and if they have eggs, get some sweets. He returns with twelve loaves of bread.",
        "Can we know who the hell General Failure is? He’s trying to read my hard drive.",
        "What’s the difference between Windows and a virus? The virus works, and it’s free."
    ]
}